//男的文字
var MsgInforMan = {
    0: '你是哪个单位的？出牌这么慢',
    1: '这牌打的真精彩呀!',
    2: '你这牌打得太让人无语了。',
    3: '哈哈，没了吧！',
    4: '小树不修不直溜...',
    5: '唉呀！走着瞧',
}
//女的文字
var MsgInforWoman = {
    0: '唉！你要耽误人家约会了',
    1: '哈哈，真爽，太过瘾了',
    2: '拜托！有你这样玩牌的吗？',
    3: '哈哈，没了吧！',
    4: '小树不修不直溜...',
    5: '小样！你给我等着',
}

//房间配置
var RoomPlayTypes = {
    0: '30局',
    1: '60局',
    2: '满5人10起',
    3: '满5人9起',
    4: '烂锅翻倍',
    5: '反作弊房',
    6: '10起',
    7: '9起',
    8: '全坑(2-A)',
    9: '带王',
    10: '请在手机设置里开启定位服务',
    11: '(半坑)',


    12: '32张牌',
    13: 'A到10',
    14: 'A到K',
    15: '带王',
    16: '不带王',
    // 17:'20分封顶',
    // 18:'30分封顶',
    // 19:'50分封顶',

}

var roomType = {
    0: '',
    1: '6局',
    2: '12局',
    3: '20局',
}

var playTypes = [
    [
        '叫分玩法',
        '经典玩法'
    ],
    [
        '随机叫地主',
        '先出完先叫地主',
    ],
    [
        '分封顶',
    ],
    [
        '',
        '撅头',
    ],
    [
        '',
        '2王或4个2必叫地主'
    ],
    // [
    //     '',
    //     '记牌器',
    // ],
]


//男的文字
var MsgPyInforMan = {
    0: '合不合理',
    1: '不合理',
    2: '让我来',
    3: '你管',
    4: '出单',
    5: '打对',
    6: '要龙',
    7: '放他',
    8: '我沉底',
    9: '免雪',
    10: '雪牌',
}
//女的文字
var MsgPyInforWoman = {
    0: '合不合理',
    1: '不合理',
    2: '让我来',
    3: '你管',
    4: '出单',
    5: '打对',
    6: '要龙',
    7: '放他',
    8: '我沉底',
    9: '免雪',
    10: '雪牌',
}


module.exports = {
    MsgInforWoman: MsgInforWoman,
    MsgInforMan: MsgInforMan,
    RoomPlayTypes: RoomPlayTypes,
    roomType: roomType,
    playTypes: playTypes,
    MsgPyInforMan: MsgPyInforMan,
    MsgPyInforWoman: MsgPyInforWoman,
};
